{
  "testis": [
    {
      "imgUrl": "https://avatars.githubusercontent.com/u/80211467?v=4",
      "fullName": "Jahid Imran",
      "position": "Independent Security Researcher",
      "text": "Biplob is humble, supportive, very dedicated and passionate about his work. I've found his projects really interesting and unique, specially, DIU Speeder, BLC Auto Login and YT Subscription Transfer. He's a leading team player with good effective communication skill and helpful towards his peer.",
      "link": "https://twitter.com/badxcode"
    },
    {
      "imgUrl": "https://raw.githubusercontent.com/biplobsd/biplobsd.github.io/data/images/action-tokens/joseUrquiza.jpg",
      "fullName": "Jose Urquiza",
      "position": "Founder and CEO - Action Tokens",
      "text": "It has been an amazing experience working together. Biplob has been instrumental in bringing our ideas to reality, allowing us to test new innovative ways for artists to connect and reward their fans. Very excited to see what's next!",
      "link": "https://twitter.com/hollowvox"
    },
    {
      "imgUrl": "https://raw.githubusercontent.com/biplobsd/biplobsd.github.io/data/images/Christian-Ullmann.jpg",
      "fullName": "Christian Ullmann",
      "position": "Senior Associate - Data Management at Fannie Mae",
      "text": "Biplob did an amazing job troubleshooting and fixing a browser extension that I wanted to use, saving me hours of my own time.",
      "link": "https://www.linkedin.com/in/christianullmann/"
    },
    {
      "imgUrl": "https://faculty.daffodilvarsity.edu.bd/images/teacher/9319018eb335d3c27aac61a862d47794.jpg",
      "fullName": "Nushrat Jahan Ria",
      "position": "Lecturer, Daffodil International University",
      "text": "Working with Biplob Kumar Sutradhar on a machine learning NLP-based research paper was a pleasure. His dedication, curiosity, and attention to detail were impressive. Biplob and his team made significant contributions to the project and demonstrated a strong understanding of the concepts. I have no doubt that he will be successful in his future endeavors.",
      "link": "https://www.linkedin.com/in/nushrat-jahan-ria"
    },
    {
      "imgUrl": "https://avatars.githubusercontent.com/u/19178331?v=4",
      "fullName": "Jack McKew",
      "position": "Data Scientist",
      "text": "Biplob provided an extremely useful utility to my open source project enabling users flexible interactivity. This contribution was invaluable and is used in over 150 codebases!",
      "link": "http://jackmckew.dev/"
    },
    {
      "imgUrl": "https://raw.githubusercontent.com/biplobsd/biplobsd.github.io/data/images/Ratul-Karim.jpg",
      "fullName": "Ratul Karim",
      "position": "Digital Marketer & Google ads expert",
      "text": "I consider myself incredibly fortunate to have met Biplob during our university journey. He has been an exceptional friend and a pillar of support throughout our time in the Computer Science and Engineering department.",
      "link": "https://rkpromote.com/"
    },
    {
      "imgUrl": "https://avatars.githubusercontent.com/u/87743297?v=4",
      "fullName": "mikeje",
      "position": "Research scholar",
      "text": "I just wanted to express my deep gratitude for the dedicated work of Biplob Sutradhar. He's a genius, he helped me in solving Colab related issues.",
      "link": "https://github.com/mikeje"
    }
  ]
}
