{"pageProps":{"data":"\n![preview](https://raw.githubusercontent.com/SpeedOut-Source/pnp-data/main/images/all-devices-black-pnp.png)\n\n# What is PNP?\n\nPNP, or Portfolio NextJs Project, is a portfolio website built using the NextJS framework. It is a static website that can be hosted on any static web hosting platform. PNP is a completely free and open-source project. It helps you showcase your skills and services. If anyone wants to know about your business or your personality, this type of website will boost you to the level you need.\n\n## Getting Started\n\nThis guide shows you how to set up PNP on your GitHub account.\n\n## What do you need?\n\n- GitHub account\n- Google Maps API key\n- Algolia for search API\n- Giscus\n- Buy Me a Coffee\n- Domain (Optional) [GitHub Pages provides free .github.io domains]\n\n## GitHub Account\n\nWhy do we need a GitHub account? GitHub Pages hosting is completely free. We use GitHub Pages to host the PNP website. GitHub Pages also provides SSL for free. How to create a GitHub account? You can simply go to https://github.com/join and follow their instructions to create a GitHub account.\n\n## Google Maps API Key\n\nOn the PNP contact page, we embed a Google Map to show your location on Earth. To do this, we need a Google Maps API key. You can follow the instructions provided by Google Maps in their documentation under the \"Create API Keys\" section -> https://developers.google.com/maps/documentation/embed/get-api-key#create-api-keys\n\n## Algolia\n\nSince PNP is a static site, it is not possible to have a search feature on the page without a server. The search feature in PNP is built using Algolia, which is a hosted search engine. To integrate Algolia, you will need an Algolia account. Please visit https://www.algolia.com/dashboard and create an Algolia account and application. After that, collect the following information: Application ID, Search-Only API Key, and Admin API Key.\n\nNext, create five indexes under your application:\n\n- Testimonials\n- Company\n- Blogs\n- Apps\n- Projects\n\nOnce you have successfully set up all the content, you will need to search the table field in the Algolia console.\n\n## Giscus\n\nGiscus is a comments system powered by GitHub Discussions. To set up Giscus, go to https://giscus.app/ and set it up for your repository. After that, take note of the `REPO_ID`, `CATEGORY`, and `CATEGORY_ID`.\n\n## Buy Me a Coffee\n\n\"Buy me a coffee\" is a support system. Go to https://www.buymeacoffee.com/ and create an account. Then collect your username.\n\n## Domain (Optional)\n\nRegister a domain from any domain registrar platform, such as Google Domains, Namecheap, GoDaddy, etc.\n\nOnce you have completed these primary setups, you will be able to proceed to the next step.\n\n# Setup\n\nNow set up PNP data in your GitHub account. To do this, follow the section below:\n\n## Fork the pnp-data Repository\n\nThe source code for the PNP site is located at [SpeedOut-Source/pnp](https://github.com/SpeedOut-Source/pnp), while the data part is in [SpeedOut-Source/pnp-data](https://github.com/SpeedOut-Source/pnp-data). If you want to change any content on the PNP site, update the pnp-data repository.\n\nTo fork the pnp-data repository, go to https://github.com/SpeedOut-Source/pnp-data and click the Fork button in the top-right corner. Set the Repository name to your GitHub username.github.io. For example, if your GitHub username is abcd, your repository name would be abcd.github.io. Click on Create fork and wait for a few moments for a copy of the pnp-data repository to be created under your GitHub account.\n\n## Update Repository Secret Variables\n\nGo to the repository's settings, navigate to Security > Actions, and under Repository secrets, create a new repository secret. Set the name as `ALGOLIA_SEARCH_ADMIN_KEY`, and the secret value should be your Algolia Admin API Key.\n\n## Update Workflow Permissions\n\nIn the repository settings, go to Actions > General. On the page, navigate to the Workflow permissions section and toggle the switch to enable `Read and write permissions`.\n\n## Changing .env.local\n\nThe .env.local file contains the environment variables for the PNP site, including site configuration. Update each variable according to your information. For example:\n\n- `NEXT_PUBLIC_PERSON_NAME`: Your full name, which will be displayed in the header and footer.\n- `NEXT_PUBLIC_BASE_URL`: Your username.github.io or your domain name.\n  Once you have made these changes, your PNP site will be live at your `<username>.github.io`. Now you need to configure and set up your data.\n\n## Setup your Data\n\nExplore each file and folder where you need to make updates. Change the necessary values while keeping in mind not to change any keys, only update the values. Here are the files that need to be updated:\n\n## Update configs.json\n\nUpdate all values except `baseUrl` and `baseImgPath`.\n\n## Update home/bio.json\n\nUpdate your `name`, `profession`, and `text`: information about yourself.\n\n## Update home/expertise.json\n\nUpdate your areas of expertise in technology.\n\n## Update home/testimonials.json\n\nPlace your testimonials in the `testis` section.\n\n## apps, company, projects, blogs directories\n\nIn these directories, you can create markdown (.md) files to update your site. A demo .md file is already provided in the folder to give you an idea of how to create a .md file.\n\n## images directory\n\nPlace all the images you need for `blogs`, `projects`, and `company` posts in this directory.\n\nNote: The compileData.py script will automatically replace `./images/<fileName>` when run on the GitHub Actions workflow.\n\n## Update privacy-policy.md\n\nThis file, located at the root path, contains your privacy policy. Change or update it according to your policy.\n\n## meta_tags.txt\n\nThis file contains meta tags for the head section of your HTML. If you need to set specific meta tags for each page in the head section, place them in this file. This is particularly useful when other sites need to verify that PNP is your site.\n\n## public directory\n\nIf you place any files in this directory, they will be accessible at your `<username>.github.io/<your_filename>`.\n\nPlease comment in the section below if you do not understand any of the sections. Alternatively, you can join us on the Telegram group.\n\nhttps://t.me/+fAPG7kz2erYyNzY9\n","configs":{"appName":"Biplob Sutradhar","twitterHandle":"@biplobsd11","baseUrl":"https://raw.githubusercontent.com","repoPath":"/biplobsd/biplobsd.github.io","resumePath":"/data/files/Biplob-Kumar-Sutradhar-resume.pdf","baseImgPath":"/data/images/"},"itemView":{"imgUrl":"https://raw.githubusercontent.com/SpeedOut-Source/pnp-data/main/images/all-devices-black-pnp.png","title":"PNP Setup Guide GitHub, Google Maps API, Algolia, Giscus, Buy Me a Coffee, and Domain Configuration","desc":"PNP, or Portfolio NextJs Project, is a portfolio website built using the NextJS framework. It is a static website that can be hosted on any static web hosting platform. PNP is a completely free and open-source project.","date":1684743746000,"readTime":5,"fileName":"get-started.md","imgBlurData":null},"previous":null,"next":{"imgUrl":"https://user-images.githubusercontent.com/43641536/227714912-f2fb693d-8b4d-4f26-8013-15a9eddb2203.gif","title":"BLC(Blended Learning Center) তে কিছু সময় পরপর logout হয়ে যাচ্ছে? অথবা কিছু দিন পরে BLC তে visit করলে আবার login করা লাগছে?","desc":"","date":1683225317000,"readTime":1,"fileName":"blc-auto-logo.bn.md","imgBlurData":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAQAAAADCAIAAAA7ljmRAAAACXBIWXMAAAPoAAAD6AG1e1JrAAAAMklEQVR4nAEnANj/AAAVNAANKQ0HJAgSKAB6vf/Wo///SJv/nKgAfpTOjwA+001g/+KF9FQQYP29wZ4AAAAASUVORK5CYII="},"type":"blogs","more4":null},"__N_SSG":true}